# Тестирование приложения "SudokuApp"

## Запланированные действия:

### Аутентификация и учетная запись
1. Ввод корректных данных при входе
2. Ввод некорректных данных при входе
3. Регистрация нового пользователя с корректными данными
4. Попытка регистрации с уже существующим логином
5. Нажатие на кнопку выхода из аккаунта

### Выбор игрового режима
6. Выбор классического судоку
7. Выбор судоку с ограничением по времени
8. Нажатие кнопки "Информация" на экране выбора режима

### Уровни
9. Начало нового уровня в классическом судоку
10. Попытка открыть несозданный уровень

### Интерфейс профиля
11. Нажатие кнопки "Войти" (неавторизованный пользователь)
12. Нажатие кнопки "Выйти" (авторизованный пользователь)

### Геймплей
13. Ввод числа в клетку
14. Попытка ввода некорректного значения
15. Завершение уровня (все клетки заполнены корректно)
16. Завершение уровня с ошибками

### Проверка производительности
17. Быстрое переключение между экранами
18. Запуск приложения без интернет-соединения
